Repository: CofficLab/GitOK
Catalog: Packages/PluginGitCLI/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Battle-tested
zh_hans: 久经考验
zh_hk: 久經考驗

source: Commit, branch, diff, stash, and more — all through the git command line.
zh_hans: 提交、分支、差异、暂存等操作全部经由 git 命令行完成。
zh_hk: 提交、分支、差異、暫存等操作全部經由 git 命令列完成。

source: Core Capabilities
zh_hans: 核心能力
zh_hk: 核心能力

source: Drive every Git operation through the system git command.
zh_hans: 所有 Git 操作都由系统 git 命令驱动。
zh_hk: 所有 Git 操作都由系統 git 命令驅動。

source: Full Git Surface
zh_hans: 完整 Git 能力
zh_hk: 完整 Git 能力

source: GitOK translates every action into a precise git invocation.
zh_hans: GitOK 把每个操作翻译为精确的 git 调用。
zh_hk: GitOK 把每個操作翻譯為精確的 git 呼叫。

source: GitOK turns the output into structured data for the UI.
zh_hans: GitOK 把输出转换成界面使用的结构化数据。
zh_hk: GitOK 把輸出轉換成介面使用的結構化資料。

source: Honors your global git config, hooks, credential helpers, and SSH setup.
zh_hans: 遵循你的全局 git 配置、钩子、凭据助手与 SSH 设置。
zh_hk: 遵循你的全域 git 設定、鉤子、憑證助手與 SSH 設定。

source: How It Works
zh_hans: 工作原理
zh_hk: 工作原理

source: Issue a command
zh_hans: 发起命令
zh_hk: 發起命令

source: Parse the result
zh_hans: 解析结果
zh_hk: 解析結果

source: Reliable
zh_hans: 稳定可靠
zh_hk: 穩定可靠

source: Run git
zh_hans: 运行 git
zh_hk: 執行 git

source: System Integration
zh_hans: 系统集成
zh_hk: 系統整合

source: System git
zh_hans: 系统 git
zh_hk: 系統 git

source: The same battle-tested engine used by millions of developers every day.
zh_hans: 与全球数百万开发者每天都在使用的引擎同源。
zh_hk: 與全球數百萬開發者每天都在使用的引擎同源。

source: The system git binary executes with the repository as its working directory.
zh_hans: 系统 git 以仓库为工作目录执行。
zh_hk: 系統 git 以儲存庫為工作目錄執行。

source: Zero install
zh_hans: 零安装
zh_hk: 零安裝

source: extra dependencies
zh_hans: 额外依赖
zh_hk: 額外依賴

source: git compatibility
zh_hans: git 兼容性
zh_hk: git 相容性
